{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Wikidata items"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: sparqlwrapper in /opt/conda/lib/python3.7/site-packages (1.8.5)\r\n",
      "Requirement already satisfied: rdflib>=4.0 in /opt/conda/lib/python3.7/site-packages (from sparqlwrapper) (4.2.2)\r\n",
      "Requirement already satisfied: pyparsing in /opt/conda/lib/python3.7/site-packages (from rdflib>=4.0->sparqlwrapper) (2.4.6)\r\n",
      "Requirement already satisfied: isodate in /opt/conda/lib/python3.7/site-packages (from rdflib>=4.0->sparqlwrapper) (0.6.0)\r\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.7/site-packages (from isodate->rdflib>=4.0->sparqlwrapper) (1.14.0)\r\n"
     ]
    }
   ],
   "source": [
    "!pip install sparqlwrapper\n",
    "\n",
    "import sys\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas as pd\n",
    "import re\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Query Wikidata function\n",
    "\n",
    "The function takes a SPARQL query string as its argument. It will run the SPARQL query and return the result as a data frame"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_wikidata(query):\n",
    "    endpoint_url = \"https://query.wikidata.org/sparql\"\n",
    "\n",
    "    def get_results(endpoint_url, query):\n",
    "        user_agent = \"WDQS-example Python/%s.%s\" % (sys.version_info[0], sys.version_info[1])\n",
    "        # TODO adjust user agent; see https://w.wiki/CX6\n",
    "        sparql = SPARQLWrapper(endpoint_url, agent=user_agent)\n",
    "        sparql.setQuery(query)\n",
    "        sparql.setReturnFormat(JSON)\n",
    "        return sparql.query().convert()\n",
    "\n",
    "\n",
    "    results = get_results(endpoint_url, query)\n",
    "\n",
    "    raw = pd.json_normalize(results[\"results\"][\"bindings\"])\n",
    "\n",
    "    df = raw.filter(regex=\"\\.value$\")\n",
    "    df = df.rename(columns=lambda x: re.sub('\\.value$','',x))\n",
    "    \n",
    "    if 'orcid' not in df.columns:\n",
    "        df['orcid'] = None\n",
    "    if 'au_dict_bio' not in df.columns:\n",
    "        df['au_dict_bio'] = None\n",
    "    \n",
    "    # order columns so that they are always in the same order\n",
    "    cols = ['item', 'itemLabel', 'orcid', 'viaf', 'isni', 'harv', 'ipni', 'abbr', 'bloodhound_id', 'enc_au_sc_id', 'au_dict_bio',\n",
    "            'yob', 'yod', 'wyb', 'wye']\n",
    "    df = df[cols]\n",
    "    \n",
    "    return df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## SPARQL queries\n",
    "\n",
    "Because wildcard search against item label in Wikidata are very slow and generally time out, we run a number of searches on the presence of relavant identifiers.\n",
    "\n",
    "SPARQL queries courtesy of Mathias Dillen, Botanic Garden Meise: https://github.com/matdillen/STSM-wikidata-people/blob/master/collectormatching.Rmd. I have changed them slightly by removing the identifier the presence of which is queried on from the SELECT clause and adding the Harvard Index of Botanists ID (P6264), IPNI ID (P586) and IPNI Standard Form (P428). This way all queries return the same terms and no data will be lost when duplicates are removed. The added terms will be valuable for verifying matches later on.\n",
    "\n",
    "Update 2020-04-14: Added Bloodhound Tracker ID (P6944) and Encyclopedia of Australian Science (P4228).\n",
    "\n",
    "Update 2020-04-16: Added Australian Dictionary of Biography (P1907). Also tried Trove (P1315), but that query times out."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Entomologists of the world (P5370)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries = {}\n",
    "\n",
    "queries['ento'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye \n",
    "  ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id ?au_dict_bio\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P5370 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid . }\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf . }\n",
    "  OPTIONAL { ?item wdt:P213 ?isni . }\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P1907 ?au_dict_bio . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### BHL creators (P4081)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['bhl_creator'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye \n",
    "  ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id ?au_dict_bio\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P4081 ?id .\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid . }\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf . }\n",
    "  OPTIONAL { ?item wdt:P213 ?isni . }\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P1907 ?au_dict_bio . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Harvard Index of Botanists ID (P6264)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['harvard_index'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye \n",
    "  ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id ?au_dict_bio\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P6264 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid . }\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf . }\n",
    "  OPTIONAL { ?item wdt:P213 ?isni . }\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P1907 ?au_dict_bio . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Zoobank ID (P2006)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['zoobank_id'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye \n",
    "  ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id ?au_dict_bio\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P2006 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid .}\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf .}\n",
    "  OPTIONAL { ?item wdt:P213 ?isni .}\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P1907 ?au_dict_bio . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### IPNI ID (P586)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['ipni_id'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye \n",
    "  ?harv ?ipni ?abbr  ?bloodhound_id ?enc_au_sc_id ?au_dict_bio\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P586 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid .}\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf .}\n",
    "  OPTIONAL { ?item wdt:P213 ?isni .}\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P1907 ?au_dict_bio . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Wikispecies article"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['wikispecies'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye \n",
    "  ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id ?au_dict_bio\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?id schema:about ?item ;\n",
    "    schema:isPartOf <https://species.wikimedia.org/> .\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n",
    "  OPTIONAL { ?item wdt:P496 ?orcid . }\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf . }\n",
    "  OPTIONAL { ?item wdt:P213 ?isni . }\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P1907 ?au_dict_bio . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Bloodhound Tracker ID (P6944)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['bloodhound_id'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye \n",
    "  ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id ?au_dict_bio\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P6944 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid .}\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf .}\n",
    "  OPTIONAL { ?item wdt:P213 ?isni .}\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P1907 ?au_dict_bio . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Encyclopedia of Australian Science ID (P4228)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['encyclopedia_australian_science_id'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye \n",
    "  ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id ?au_dict_bio\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P4228 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid .}\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf .}\n",
    "  OPTIONAL { ?item wdt:P213 ?isni .}\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P1907 ?au_dict_bio . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Australian Dictionary of Biography (P1907)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['australian_dictionary_biography'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye \n",
    "  ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id ?au_dict_bio\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P1907 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid . }\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf . }\n",
    "  OPTIONAL { ?item wdt:P213 ?isni . }\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P1907 ?au_dict_bio . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create the data frame\n",
    "\n",
    "Run all the SPARQL requests, concatenate the results and drop duplicates"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ento: 10664 records\n",
      "bhl_creator: 24332 records\n",
      "harvard_index: 23877 records\n",
      "zoobank_id: 15226 records\n",
      "ipni_id: 54701 records\n",
      "wikispecies: 46509 records\n",
      "bloodhound_id: 1639 records\n",
      "encyclopedia_australian_science_id: 2842 records\n",
      "australian_dictionary_biography: 13479 records\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>item</th>\n",
       "      <th>itemLabel</th>\n",
       "      <th>orcid</th>\n",
       "      <th>viaf</th>\n",
       "      <th>isni</th>\n",
       "      <th>harv</th>\n",
       "      <th>ipni</th>\n",
       "      <th>abbr</th>\n",
       "      <th>bloodhound_id</th>\n",
       "      <th>enc_au_sc_id</th>\n",
       "      <th>au_dict_bio</th>\n",
       "      <th>yob</th>\n",
       "      <th>yod</th>\n",
       "      <th>wyb</th>\n",
       "      <th>wye</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q67329</td>\n",
       "      <td>Carl Gustav Jablonsky</td>\n",
       "      <td>NaN</td>\n",
       "      <td>24944037</td>\n",
       "      <td>0000 0000 5526 3001</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1756</td>\n",
       "      <td>1787</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q68738</td>\n",
       "      <td>Hermann Müller</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2532803</td>\n",
       "      <td>0000 0001 0837 1728</td>\n",
       "      <td>36129</td>\n",
       "      <td>6735-1</td>\n",
       "      <td>H.Müll.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1829</td>\n",
       "      <td>1883</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66902</td>\n",
       "      <td>Hermann Lebert</td>\n",
       "      <td>NaN</td>\n",
       "      <td>27833384</td>\n",
       "      <td>0000 0001 2100 1924</td>\n",
       "      <td>67704</td>\n",
       "      <td>22162-1</td>\n",
       "      <td>Lebert</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1813</td>\n",
       "      <td>1878</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q69552</td>\n",
       "      <td>Carl Julius Bernhard Börner</td>\n",
       "      <td>NaN</td>\n",
       "      <td>118457204</td>\n",
       "      <td>0000 0001 1085 9124</td>\n",
       "      <td>1763</td>\n",
       "      <td>12350-1</td>\n",
       "      <td>Börner</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1880</td>\n",
       "      <td>1953</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66379</td>\n",
       "      <td>Ludwig Bechstein</td>\n",
       "      <td>NaN</td>\n",
       "      <td>36914329</td>\n",
       "      <td>0000 0001 2278 3438</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1801</td>\n",
       "      <td>1860</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    item                    itemLabel orcid  \\\n",
       "0  http://www.wikidata.org/entity/Q67329        Carl Gustav Jablonsky   NaN   \n",
       "1  http://www.wikidata.org/entity/Q68738               Hermann Müller   NaN   \n",
       "2  http://www.wikidata.org/entity/Q66902               Hermann Lebert   NaN   \n",
       "3  http://www.wikidata.org/entity/Q69552  Carl Julius Bernhard Börner   NaN   \n",
       "4  http://www.wikidata.org/entity/Q66379             Ludwig Bechstein   NaN   \n",
       "\n",
       "        viaf                 isni   harv     ipni     abbr bloodhound_id  \\\n",
       "0   24944037  0000 0000 5526 3001    NaN      NaN      NaN           NaN   \n",
       "1    2532803  0000 0001 0837 1728  36129   6735-1  H.Müll.           NaN   \n",
       "2   27833384  0000 0001 2100 1924  67704  22162-1   Lebert           NaN   \n",
       "3  118457204  0000 0001 1085 9124   1763  12350-1   Börner           NaN   \n",
       "4   36914329  0000 0001 2278 3438    NaN      NaN      NaN           NaN   \n",
       "\n",
       "  enc_au_sc_id au_dict_bio   yob   yod  wyb  wye  \n",
       "0          NaN         NaN  1756  1787  NaN  NaN  \n",
       "1          NaN         NaN  1829  1883  NaN  NaN  \n",
       "2          NaN         NaN  1813  1878  NaN  NaN  \n",
       "3          NaN         NaN  1880  1953  NaN  NaN  \n",
       "4          NaN         NaN  1801  1860  NaN  NaN  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Run the queries and create a list of data frames\n",
    "frames = []\n",
    "for key, query in queries.items():\n",
    "    dfi = query_wikidata(query)\n",
    "    print(key + ': ' + str(len(dfi.index)) + ' records')\n",
    "    frames.append(dfi)\n",
    "\n",
    "# Concatenate the dataframes from each SPARQL request\n",
    "df = pd.concat(frames)\n",
    "\n",
    "# Drop duplicates\n",
    "df = df.drop_duplicates(subset=['item'])\n",
    "\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Add surname, initials and canonical string (`surname` + ', ' + `initials`) columns "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>item</th>\n",
       "      <th>itemLabel</th>\n",
       "      <th>orcid</th>\n",
       "      <th>viaf</th>\n",
       "      <th>isni</th>\n",
       "      <th>harv</th>\n",
       "      <th>ipni</th>\n",
       "      <th>abbr</th>\n",
       "      <th>bloodhound_id</th>\n",
       "      <th>enc_au_sc_id</th>\n",
       "      <th>au_dict_bio</th>\n",
       "      <th>yob</th>\n",
       "      <th>yod</th>\n",
       "      <th>wyb</th>\n",
       "      <th>wye</th>\n",
       "      <th>surname</th>\n",
       "      <th>initials</th>\n",
       "      <th>canonical_string</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q67329</td>\n",
       "      <td>Carl Gustav Jablonsky</td>\n",
       "      <td>NaN</td>\n",
       "      <td>24944037</td>\n",
       "      <td>0000 0000 5526 3001</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1756</td>\n",
       "      <td>1787</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Jablonsky</td>\n",
       "      <td>C.G.</td>\n",
       "      <td>Jablonsky, C.G.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q68738</td>\n",
       "      <td>Hermann Müller</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2532803</td>\n",
       "      <td>0000 0001 0837 1728</td>\n",
       "      <td>36129</td>\n",
       "      <td>6735-1</td>\n",
       "      <td>H.Müll.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1829</td>\n",
       "      <td>1883</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Müller</td>\n",
       "      <td>H.</td>\n",
       "      <td>Müller, H.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66902</td>\n",
       "      <td>Hermann Lebert</td>\n",
       "      <td>NaN</td>\n",
       "      <td>27833384</td>\n",
       "      <td>0000 0001 2100 1924</td>\n",
       "      <td>67704</td>\n",
       "      <td>22162-1</td>\n",
       "      <td>Lebert</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1813</td>\n",
       "      <td>1878</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Lebert</td>\n",
       "      <td>H.</td>\n",
       "      <td>Lebert, H.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q69552</td>\n",
       "      <td>Carl Julius Bernhard Börner</td>\n",
       "      <td>NaN</td>\n",
       "      <td>118457204</td>\n",
       "      <td>0000 0001 1085 9124</td>\n",
       "      <td>1763</td>\n",
       "      <td>12350-1</td>\n",
       "      <td>Börner</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1880</td>\n",
       "      <td>1953</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Börner</td>\n",
       "      <td>C.J.B.</td>\n",
       "      <td>Börner, C.J.B.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66379</td>\n",
       "      <td>Ludwig Bechstein</td>\n",
       "      <td>NaN</td>\n",
       "      <td>36914329</td>\n",
       "      <td>0000 0001 2278 3438</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1801</td>\n",
       "      <td>1860</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Bechstein</td>\n",
       "      <td>L.</td>\n",
       "      <td>Bechstein, L.</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    item                    itemLabel orcid  \\\n",
       "0  http://www.wikidata.org/entity/Q67329        Carl Gustav Jablonsky   NaN   \n",
       "1  http://www.wikidata.org/entity/Q68738               Hermann Müller   NaN   \n",
       "2  http://www.wikidata.org/entity/Q66902               Hermann Lebert   NaN   \n",
       "3  http://www.wikidata.org/entity/Q69552  Carl Julius Bernhard Börner   NaN   \n",
       "4  http://www.wikidata.org/entity/Q66379             Ludwig Bechstein   NaN   \n",
       "\n",
       "        viaf                 isni   harv     ipni     abbr bloodhound_id  \\\n",
       "0   24944037  0000 0000 5526 3001    NaN      NaN      NaN           NaN   \n",
       "1    2532803  0000 0001 0837 1728  36129   6735-1  H.Müll.           NaN   \n",
       "2   27833384  0000 0001 2100 1924  67704  22162-1   Lebert           NaN   \n",
       "3  118457204  0000 0001 1085 9124   1763  12350-1   Börner           NaN   \n",
       "4   36914329  0000 0001 2278 3438    NaN      NaN      NaN           NaN   \n",
       "\n",
       "  enc_au_sc_id au_dict_bio   yob   yod  wyb  wye    surname initials  \\\n",
       "0          NaN         NaN  1756  1787  NaN  NaN  Jablonsky     C.G.   \n",
       "1          NaN         NaN  1829  1883  NaN  NaN     Müller       H.   \n",
       "2          NaN         NaN  1813  1878  NaN  NaN     Lebert       H.   \n",
       "3          NaN         NaN  1880  1953  NaN  NaN     Börner   C.J.B.   \n",
       "4          NaN         NaN  1801  1860  NaN  NaN  Bechstein       L.   \n",
       "\n",
       "  canonical_string  \n",
       "0  Jablonsky, C.G.  \n",
       "1       Müller, H.  \n",
       "2       Lebert, H.  \n",
       "3   Börner, C.J.B.  \n",
       "4    Bechstein, L.  "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "surname = []\n",
    "initials = []\n",
    "canonical = []\n",
    "\n",
    "for i, item in df.iterrows():\n",
    "    words = re.split('[ .]', item['itemLabel'])\n",
    "    words = [string for string in words if string != \"\"]\n",
    "    surname.append(words[-1])\n",
    "    initials.append(\".\".join([x[0] for x in words[0:-1]]) + '.')\n",
    "    canonical.append(words[-1] + ', ' + \".\".join([x[0] for x in words[0:-1] if len(x) > 0]) + '.')\n",
    "    \n",
    "df['surname'] = surname\n",
    "df['initials'] = initials\n",
    "df['canonical_string'] = canonical\n",
    "    \n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>item</th>\n",
       "      <th>itemLabel</th>\n",
       "      <th>surname</th>\n",
       "      <th>initials</th>\n",
       "      <th>canonical_string</th>\n",
       "      <th>orcid</th>\n",
       "      <th>viaf</th>\n",
       "      <th>isni</th>\n",
       "      <th>harv</th>\n",
       "      <th>ipni</th>\n",
       "      <th>abbr</th>\n",
       "      <th>bloodhound_id</th>\n",
       "      <th>enc_au_sc_id</th>\n",
       "      <th>au_dict_bio</th>\n",
       "      <th>yob</th>\n",
       "      <th>yod</th>\n",
       "      <th>wyb</th>\n",
       "      <th>wye</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q67329</td>\n",
       "      <td>Carl Gustav Jablonsky</td>\n",
       "      <td>Jablonsky</td>\n",
       "      <td>C.G.</td>\n",
       "      <td>Jablonsky, C.G.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>24944037</td>\n",
       "      <td>0000 0000 5526 3001</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1756</td>\n",
       "      <td>1787</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q68738</td>\n",
       "      <td>Hermann Müller</td>\n",
       "      <td>Müller</td>\n",
       "      <td>H.</td>\n",
       "      <td>Müller, H.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2532803</td>\n",
       "      <td>0000 0001 0837 1728</td>\n",
       "      <td>36129</td>\n",
       "      <td>6735-1</td>\n",
       "      <td>H.Müll.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1829</td>\n",
       "      <td>1883</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66902</td>\n",
       "      <td>Hermann Lebert</td>\n",
       "      <td>Lebert</td>\n",
       "      <td>H.</td>\n",
       "      <td>Lebert, H.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>27833384</td>\n",
       "      <td>0000 0001 2100 1924</td>\n",
       "      <td>67704</td>\n",
       "      <td>22162-1</td>\n",
       "      <td>Lebert</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1813</td>\n",
       "      <td>1878</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q69552</td>\n",
       "      <td>Carl Julius Bernhard Börner</td>\n",
       "      <td>Börner</td>\n",
       "      <td>C.J.B.</td>\n",
       "      <td>Börner, C.J.B.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>118457204</td>\n",
       "      <td>0000 0001 1085 9124</td>\n",
       "      <td>1763</td>\n",
       "      <td>12350-1</td>\n",
       "      <td>Börner</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1880</td>\n",
       "      <td>1953</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66379</td>\n",
       "      <td>Ludwig Bechstein</td>\n",
       "      <td>Bechstein</td>\n",
       "      <td>L.</td>\n",
       "      <td>Bechstein, L.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>36914329</td>\n",
       "      <td>0000 0001 2278 3438</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1801</td>\n",
       "      <td>1860</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    item                    itemLabel  \\\n",
       "0  http://www.wikidata.org/entity/Q67329        Carl Gustav Jablonsky   \n",
       "1  http://www.wikidata.org/entity/Q68738               Hermann Müller   \n",
       "2  http://www.wikidata.org/entity/Q66902               Hermann Lebert   \n",
       "3  http://www.wikidata.org/entity/Q69552  Carl Julius Bernhard Börner   \n",
       "4  http://www.wikidata.org/entity/Q66379             Ludwig Bechstein   \n",
       "\n",
       "     surname initials canonical_string orcid       viaf                 isni  \\\n",
       "0  Jablonsky     C.G.  Jablonsky, C.G.   NaN   24944037  0000 0000 5526 3001   \n",
       "1     Müller       H.       Müller, H.   NaN    2532803  0000 0001 0837 1728   \n",
       "2     Lebert       H.       Lebert, H.   NaN   27833384  0000 0001 2100 1924   \n",
       "3     Börner   C.J.B.   Börner, C.J.B.   NaN  118457204  0000 0001 1085 9124   \n",
       "4  Bechstein       L.    Bechstein, L.   NaN   36914329  0000 0001 2278 3438   \n",
       "\n",
       "    harv     ipni     abbr bloodhound_id enc_au_sc_id au_dict_bio   yob   yod  \\\n",
       "0    NaN      NaN      NaN           NaN          NaN         NaN  1756  1787   \n",
       "1  36129   6735-1  H.Müll.           NaN          NaN         NaN  1829  1883   \n",
       "2  67704  22162-1   Lebert           NaN          NaN         NaN  1813  1878   \n",
       "3   1763  12350-1   Börner           NaN          NaN         NaN  1880  1953   \n",
       "4    NaN      NaN      NaN           NaN          NaN         NaN  1801  1860   \n",
       "\n",
       "   wyb  wye  \n",
       "0  NaN  NaN  \n",
       "1  NaN  NaN  \n",
       "2  NaN  NaN  \n",
       "3  NaN  NaN  \n",
       "4  NaN  NaN  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = df[['item', 'itemLabel', \n",
    "        'surname', 'initials', 'canonical_string', \n",
    "        'orcid', 'viaf', 'isni', 'harv', 'ipni', 'abbr', 'bloodhound_id', 'enc_au_sc_id', 'au_dict_bio',\n",
    "        'yob', 'yod', 'wyb', 'wye']]\n",
    "df.reset_index(drop=True, inplace=True)\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>item</th>\n",
       "      <th>itemLabel</th>\n",
       "      <th>surname</th>\n",
       "      <th>initials</th>\n",
       "      <th>canonical_string</th>\n",
       "      <th>orcid</th>\n",
       "      <th>viaf</th>\n",
       "      <th>isni</th>\n",
       "      <th>harv</th>\n",
       "      <th>ipni</th>\n",
       "      <th>...</th>\n",
       "      <th>yod</th>\n",
       "      <th>wyb</th>\n",
       "      <th>wye</th>\n",
       "      <th>wikidata_link</th>\n",
       "      <th>orcid_link</th>\n",
       "      <th>harv_link</th>\n",
       "      <th>ipni_link</th>\n",
       "      <th>bloodhound_link</th>\n",
       "      <th>enc_au_sc_link</th>\n",
       "      <th>au_dict_bio_link</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://www.wikidata.org/entity/Q67471</td>\n",
       "      <td>Georg von Neumayer</td>\n",
       "      <td>Neumayer</td>\n",
       "      <td>G.v.</td>\n",
       "      <td>Neumayer, G.v.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>22442169</td>\n",
       "      <td>0000 0001 2330 9615</td>\n",
       "      <td>971</td>\n",
       "      <td>6934-1</td>\n",
       "      <td>...</td>\n",
       "      <td>1909</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/wiki/Q67471</td>\n",
       "      <td>None</td>\n",
       "      <td>https://kiki.huh.harvard.edu/databases/botanis...</td>\n",
       "      <td>https://www.ipni.org/a/6934-1</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.eoas.info/biogs/P000104b</td>\n",
       "      <td>http://adb.anu.edu.au/biography/neumayer-georg...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>176</th>\n",
       "      <td>http://www.wikidata.org/entity/Q76851</td>\n",
       "      <td>Amalie Dietrich</td>\n",
       "      <td>Dietrich</td>\n",
       "      <td>A.</td>\n",
       "      <td>Dietrich, A.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>77113813</td>\n",
       "      <td>0000 0000 3219 7769</td>\n",
       "      <td>8587</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>1891</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/wiki/Q76851</td>\n",
       "      <td>None</td>\n",
       "      <td>https://kiki.huh.harvard.edu/databases/botanis...</td>\n",
       "      <td>None</td>\n",
       "      <td>https://bloodhound-tracker.net/Q76851</td>\n",
       "      <td>http://www.eoas.info/biogs/P000366b</td>\n",
       "      <td>http://adb.anu.edu.au/biography/dietrich-amali...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>312</th>\n",
       "      <td>http://www.wikidata.org/entity/Q89624</td>\n",
       "      <td>John Stanislaw Kubary</td>\n",
       "      <td>Kubary</td>\n",
       "      <td>J.S.</td>\n",
       "      <td>Kubary, J.S.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>5230890</td>\n",
       "      <td>0000 0000 7141 8050</td>\n",
       "      <td>15350</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>1896</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/wiki/Q89624</td>\n",
       "      <td>None</td>\n",
       "      <td>https://kiki.huh.harvard.edu/databases/botanis...</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.eoas.info/biogs/P000125b</td>\n",
       "      <td>http://adb.anu.edu.au/biography/kubary-john-st...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>473</th>\n",
       "      <td>http://www.wikidata.org/entity/Q106178</td>\n",
       "      <td>Richard Schomburgk</td>\n",
       "      <td>Schomburgk</td>\n",
       "      <td>R.</td>\n",
       "      <td>Schomburgk, R.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>30332468</td>\n",
       "      <td>0000 0000 8368 6685</td>\n",
       "      <td>NaN</td>\n",
       "      <td>9231-1</td>\n",
       "      <td>...</td>\n",
       "      <td>1891</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/wiki/Q106178</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>https://www.ipni.org/a/9231-1</td>\n",
       "      <td>https://bloodhound-tracker.net/Q106178</td>\n",
       "      <td>http://www.eoas.info/biogs/P000141b</td>\n",
       "      <td>http://adb.anu.edu.au/biography/schomburgk-mor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>573</th>\n",
       "      <td>http://www.wikidata.org/entity/Q155764</td>\n",
       "      <td>Robert Brown</td>\n",
       "      <td>Brown</td>\n",
       "      <td>R.</td>\n",
       "      <td>Brown, R.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>34572082</td>\n",
       "      <td>0000 0000 8113 5572</td>\n",
       "      <td>38122</td>\n",
       "      <td>1192-1</td>\n",
       "      <td>...</td>\n",
       "      <td>1858</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/wiki/Q155764</td>\n",
       "      <td>None</td>\n",
       "      <td>https://kiki.huh.harvard.edu/databases/botanis...</td>\n",
       "      <td>https://www.ipni.org/a/1192-1</td>\n",
       "      <td>https://bloodhound-tracker.net/Q155764</td>\n",
       "      <td>http://www.eoas.info/biogs/P000270b</td>\n",
       "      <td>http://adb.anu.edu.au/biography/brown-robert-1835</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>117560</th>\n",
       "      <td>http://www.wikidata.org/entity/Q64826644</td>\n",
       "      <td>Jim Macdougall</td>\n",
       "      <td>Macdougall</td>\n",
       "      <td>J.</td>\n",
       "      <td>Macdougall, J.</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>1995</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/wiki/Q64826644</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://adb.anu.edu.au/biography/macdougall-jam...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>117561</th>\n",
       "      <td>http://www.wikidata.org/entity/Q79903712</td>\n",
       "      <td>Audrie Lillian McLeod</td>\n",
       "      <td>McLeod</td>\n",
       "      <td>A.L.</td>\n",
       "      <td>McLeod, A.L.</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>1992</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/wiki/Q79903712</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://adb.anu.edu.au/biography/mcleod-audrie-...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>117562</th>\n",
       "      <td>http://www.wikidata.org/entity/Q64826630</td>\n",
       "      <td>Fred Clements</td>\n",
       "      <td>Clements</td>\n",
       "      <td>F.</td>\n",
       "      <td>Clements, F.</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>1995</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/wiki/Q64826630</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://adb.anu.edu.au/biography/clements-frede...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>117563</th>\n",
       "      <td>http://www.wikidata.org/entity/Q64826392</td>\n",
       "      <td>Roy Deicke</td>\n",
       "      <td>Deicke</td>\n",
       "      <td>R.</td>\n",
       "      <td>Deicke, R.</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>1995</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/wiki/Q64826392</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://adb.anu.edu.au/biography/deicke-roy-20257</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>117564</th>\n",
       "      <td>http://www.wikidata.org/entity/Q23379</td>\n",
       "      <td>Ben Chifley</td>\n",
       "      <td>Chifley</td>\n",
       "      <td>B.</td>\n",
       "      <td>Chifley, B.</td>\n",
       "      <td>None</td>\n",
       "      <td>75039561</td>\n",
       "      <td>0000 0000 8266 4118</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>1951</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/wiki/Q23379</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://adb.anu.edu.au/biography/chifley-joseph...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>13125 rows × 25 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            item              itemLabel  \\\n",
       "10         http://www.wikidata.org/entity/Q67471     Georg von Neumayer   \n",
       "176        http://www.wikidata.org/entity/Q76851        Amalie Dietrich   \n",
       "312        http://www.wikidata.org/entity/Q89624  John Stanislaw Kubary   \n",
       "473       http://www.wikidata.org/entity/Q106178     Richard Schomburgk   \n",
       "573       http://www.wikidata.org/entity/Q155764           Robert Brown   \n",
       "...                                          ...                    ...   \n",
       "117560  http://www.wikidata.org/entity/Q64826644         Jim Macdougall   \n",
       "117561  http://www.wikidata.org/entity/Q79903712  Audrie Lillian McLeod   \n",
       "117562  http://www.wikidata.org/entity/Q64826630          Fred Clements   \n",
       "117563  http://www.wikidata.org/entity/Q64826392             Roy Deicke   \n",
       "117564     http://www.wikidata.org/entity/Q23379            Ben Chifley   \n",
       "\n",
       "           surname initials canonical_string orcid      viaf  \\\n",
       "10        Neumayer     G.v.   Neumayer, G.v.   NaN  22442169   \n",
       "176       Dietrich       A.     Dietrich, A.   NaN  77113813   \n",
       "312         Kubary     J.S.     Kubary, J.S.   NaN   5230890   \n",
       "473     Schomburgk       R.   Schomburgk, R.   NaN  30332468   \n",
       "573          Brown       R.        Brown, R.   NaN  34572082   \n",
       "...            ...      ...              ...   ...       ...   \n",
       "117560  Macdougall       J.   Macdougall, J.  None       NaN   \n",
       "117561      McLeod     A.L.     McLeod, A.L.  None       NaN   \n",
       "117562    Clements       F.     Clements, F.  None       NaN   \n",
       "117563      Deicke       R.       Deicke, R.  None       NaN   \n",
       "117564     Chifley       B.      Chifley, B.  None  75039561   \n",
       "\n",
       "                       isni   harv    ipni  ...   yod  wyb  wye  \\\n",
       "10      0000 0001 2330 9615    971  6934-1  ...  1909  NaN  NaN   \n",
       "176     0000 0000 3219 7769   8587     NaN  ...  1891  NaN  NaN   \n",
       "312     0000 0000 7141 8050  15350     NaN  ...  1896  NaN  NaN   \n",
       "473     0000 0000 8368 6685    NaN  9231-1  ...  1891  NaN  NaN   \n",
       "573     0000 0000 8113 5572  38122  1192-1  ...  1858  NaN  NaN   \n",
       "...                     ...    ...     ...  ...   ...  ...  ...   \n",
       "117560                  NaN    NaN     NaN  ...  1995  NaN  NaN   \n",
       "117561                  NaN    NaN     NaN  ...  1992  NaN  NaN   \n",
       "117562                  NaN    NaN     NaN  ...  1995  NaN  NaN   \n",
       "117563                  NaN    NaN     NaN  ...  1995  NaN  NaN   \n",
       "117564  0000 0000 8266 4118    NaN     NaN  ...  1951  NaN  NaN   \n",
       "\n",
       "                                 wikidata_link orcid_link  \\\n",
       "10         http://www.wikidata.org/wiki/Q67471       None   \n",
       "176        http://www.wikidata.org/wiki/Q76851       None   \n",
       "312        http://www.wikidata.org/wiki/Q89624       None   \n",
       "473       http://www.wikidata.org/wiki/Q106178       None   \n",
       "573       http://www.wikidata.org/wiki/Q155764       None   \n",
       "...                                        ...        ...   \n",
       "117560  http://www.wikidata.org/wiki/Q64826644       None   \n",
       "117561  http://www.wikidata.org/wiki/Q79903712       None   \n",
       "117562  http://www.wikidata.org/wiki/Q64826630       None   \n",
       "117563  http://www.wikidata.org/wiki/Q64826392       None   \n",
       "117564     http://www.wikidata.org/wiki/Q23379       None   \n",
       "\n",
       "                                                harv_link  \\\n",
       "10      https://kiki.huh.harvard.edu/databases/botanis...   \n",
       "176     https://kiki.huh.harvard.edu/databases/botanis...   \n",
       "312     https://kiki.huh.harvard.edu/databases/botanis...   \n",
       "473                                                  None   \n",
       "573     https://kiki.huh.harvard.edu/databases/botanis...   \n",
       "...                                                   ...   \n",
       "117560                                               None   \n",
       "117561                                               None   \n",
       "117562                                               None   \n",
       "117563                                               None   \n",
       "117564                                               None   \n",
       "\n",
       "                            ipni_link                         bloodhound_link  \\\n",
       "10      https://www.ipni.org/a/6934-1                                    None   \n",
       "176                              None   https://bloodhound-tracker.net/Q76851   \n",
       "312                              None                                    None   \n",
       "473     https://www.ipni.org/a/9231-1  https://bloodhound-tracker.net/Q106178   \n",
       "573     https://www.ipni.org/a/1192-1  https://bloodhound-tracker.net/Q155764   \n",
       "...                               ...                                     ...   \n",
       "117560                           None                                    None   \n",
       "117561                           None                                    None   \n",
       "117562                           None                                    None   \n",
       "117563                           None                                    None   \n",
       "117564                           None                                    None   \n",
       "\n",
       "                             enc_au_sc_link  \\\n",
       "10      http://www.eoas.info/biogs/P000104b   \n",
       "176     http://www.eoas.info/biogs/P000366b   \n",
       "312     http://www.eoas.info/biogs/P000125b   \n",
       "473     http://www.eoas.info/biogs/P000141b   \n",
       "573     http://www.eoas.info/biogs/P000270b   \n",
       "...                                     ...   \n",
       "117560                                 None   \n",
       "117561                                 None   \n",
       "117562                                 None   \n",
       "117563                                 None   \n",
       "117564                                 None   \n",
       "\n",
       "                                         au_dict_bio_link  \n",
       "10      http://adb.anu.edu.au/biography/neumayer-georg...  \n",
       "176     http://adb.anu.edu.au/biography/dietrich-amali...  \n",
       "312     http://adb.anu.edu.au/biography/kubary-john-st...  \n",
       "473     http://adb.anu.edu.au/biography/schomburgk-mor...  \n",
       "573     http://adb.anu.edu.au/biography/brown-robert-1835  \n",
       "...                                                   ...  \n",
       "117560  http://adb.anu.edu.au/biography/macdougall-jam...  \n",
       "117561  http://adb.anu.edu.au/biography/mcleod-audrie-...  \n",
       "117562  http://adb.anu.edu.au/biography/clements-frede...  \n",
       "117563   http://adb.anu.edu.au/biography/deicke-roy-20257  \n",
       "117564  http://adb.anu.edu.au/biography/chifley-joseph...  \n",
       "\n",
       "[13125 rows x 25 columns]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "wikidata_link = []\n",
    "orcid_link = []\n",
    "harv_link = []\n",
    "ipni_link = []\n",
    "bloodhound_link = []\n",
    "enc_au_sc_link = []\n",
    "au_dict_bio_link = []\n",
    "for i, row in df.iterrows():\n",
    "    wikidata_link.append(row['item'].replace('entity', 'wiki'))\n",
    "    orcid = 'https://orcid.org/' + str(row['orcid']) if pd.notnull(row['orcid']) else None\n",
    "    orcid_link.append(orcid)\n",
    "    harv_link.append('https://kiki.huh.harvard.edu/databases/botanist_search.php?mode=details&id=' + str(row['harv']) if pd.notnull(row['harv']) else None)\n",
    "    ipni_link.append('https://www.ipni.org/a/' + row['ipni'] if pd.notnull(row['ipni']) else None)\n",
    "    bloodhound_link.append('https://bloodhound-tracker.net/' + row['bloodhound_id'] if pd.notnull(row['bloodhound_id']) else None)\n",
    "    enc_au_sc_link.append('http://www.eoas.info/biogs/' + row['enc_au_sc_id'] if pd.notnull(row['enc_au_sc_id']) else None)\n",
    "    au_dict_bio_link.append('http://adb.anu.edu.au/biography/' + row['au_dict_bio'] if pd.notnull(row['au_dict_bio']) else None)\n",
    "    \n",
    "df['wikidata_link'] = wikidata_link\n",
    "df['orcid_link'] = orcid_link\n",
    "df['harv_link'] = harv_link\n",
    "df['ipni_link'] = ipni_link\n",
    "df['bloodhound_link'] = bloodhound_link\n",
    "df['enc_au_sc_link'] = enc_au_sc_link\n",
    "df['au_dict_bio_link'] = au_dict_bio_link\n",
    "\n",
    "df[df['au_dict_bio_link'].notnull()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv('data/wikidata_persons.csv')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
