{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Wikidata items"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: sparqlwrapper in /opt/conda/lib/python3.7/site-packages (1.8.5)\n",
      "Requirement already satisfied: rdflib>=4.0 in /opt/conda/lib/python3.7/site-packages (from sparqlwrapper) (4.2.2)\n",
      "Requirement already satisfied: isodate in /opt/conda/lib/python3.7/site-packages (from rdflib>=4.0->sparqlwrapper) (0.6.0)\n",
      "Requirement already satisfied: pyparsing in /opt/conda/lib/python3.7/site-packages (from rdflib>=4.0->sparqlwrapper) (2.4.6)\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.7/site-packages (from isodate->rdflib>=4.0->sparqlwrapper) (1.14.0)\n"
     ]
    }
   ],
   "source": [
    "!pip install sparqlwrapper\n",
    "\n",
    "import sys\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas as pd\n",
    "import re\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Query Wikidata function\n",
    "\n",
    "The function takes a SPARQL query string as its argument. It will run the SPARQL query and return the result as a data frame"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_wikidata(query):\n",
    "    endpoint_url = \"https://query.wikidata.org/sparql\"\n",
    "\n",
    "    def get_results(endpoint_url, query):\n",
    "        user_agent = \"WDQS-example Python/%s.%s\" % (sys.version_info[0], sys.version_info[1])\n",
    "        # TODO adjust user agent; see https://w.wiki/CX6\n",
    "        sparql = SPARQLWrapper(endpoint_url, agent=user_agent)\n",
    "        sparql.setQuery(query)\n",
    "        sparql.setReturnFormat(JSON)\n",
    "        return sparql.query().convert()\n",
    "\n",
    "\n",
    "    results = get_results(endpoint_url, query)\n",
    "\n",
    "    raw = pd.json_normalize(results[\"results\"][\"bindings\"])\n",
    "\n",
    "    df = raw.filter(regex=\"\\.value$\")\n",
    "    df = df.rename(columns=lambda x: re.sub('\\.value$','',x))\n",
    "    \n",
    "    # order columns so that they are always in the same order\n",
    "    cols = ['item', 'itemLabel', 'orcid', 'viaf', 'isni', 'harv', 'ipni', 'abbr', 'bloodhound_id', 'enc_au_sc_id',\n",
    "            'yob', 'yod', 'wyb', 'wye']\n",
    "    df = df[cols]\n",
    "    \n",
    "    return df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## SPARQL queries\n",
    "\n",
    "Because wildcard search against item label in Wikidata are very slow and generally time out, we run a number of searches on the presence of relavant identifiers.\n",
    "\n",
    "SPARQL queries courtesy of Mathias Dillen, Botanic Garden Meise: https://github.com/matdillen/STSM-wikidata-people/blob/master/collectormatching.Rmd. I have changed them slightly by removing the identifier the presence of which is queried on from the SELECT clause and adding the Harvard Index of Botanists ID (P6264), IPNI ID (P586) and IPNI Standard Form (P428). This way all queries return the same terms and no data will be lost when duplicates are removed. The added terms will be valuable for verifying matches later on."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Entomologists of the world (P5370)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries = {}\n",
    "\n",
    "queries['ento'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P5370 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid . }\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf . }\n",
    "  OPTIONAL { ?item wdt:P213 ?isni . }\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### BHL creators (P4081)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['bhl_creator'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P4081 ?id .\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid . }\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf . }\n",
    "  OPTIONAL { ?item wdt:P213 ?isni . }\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Harvard Index of Botanists ID (P6264)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['harvard_index'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P6264 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid . }\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf . }\n",
    "  OPTIONAL { ?item wdt:P213 ?isni . }\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Zoobank ID (P2006)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['zoobank_id'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P2006 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid .}\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf .}\n",
    "  OPTIONAL { ?item wdt:P213 ?isni .}\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### IPNI ID (P586)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['ipni_id'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye ?harv ?ipni ?abbr  ?bloodhound_id ?enc_au_sc_id\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P586 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid .}\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf .}\n",
    "  OPTIONAL { ?item wdt:P213 ?isni .}\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Wikispecies article"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['wikispecies'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?id schema:about ?item ;\n",
    "    schema:isPartOf <https://species.wikimedia.org/> .\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n",
    "  OPTIONAL { ?item wdt:P496 ?orcid . }\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf . }\n",
    "  OPTIONAL { ?item wdt:P213 ?isni . }\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Bloodhound Tracker ID (P6944)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['bloodhound_id'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P6944 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid .}\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf .}\n",
    "  OPTIONAL { ?item wdt:P213 ?isni .}\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Encyclopedia of Australian Science ID (P4228)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "queries['encyclopedia_australian_science_id'] = \"\"\"\n",
    "SELECT DISTINCT ?item ?itemLabel ?orcid ?viaf ?isni ?yob ?yod ?fly ?wyb ?wye ?harv ?ipni ?abbr ?bloodhound_id ?enc_au_sc_id\n",
    "WHERE {\n",
    "  ?item wdt:P31 wd:Q5 .\n",
    "  ?item wdt:P4228 ?id . \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" } \n",
    "  OPTIONAL { ?item wdt:P496 ?orcid .}\n",
    "  OPTIONAL { ?item wdt:P214 ?viaf .}\n",
    "  OPTIONAL { ?item wdt:P213 ?isni .}\n",
    "  OPTIONAL { ?item wdt:P6264 ?harv . }\n",
    "  OPTIONAL { ?item wdt:P586 ?ipni . }\n",
    "  OPTIONAL { ?item wdt:P428 ?abbr . }\n",
    "  OPTIONAL { ?item wdt:P6944 ?bloodhound_id . }\n",
    "  OPTIONAL { ?item wdt:P4228 ?enc_au_sc_id . }\n",
    "  OPTIONAL { ?item wdt:P569 ?dob . BIND(YEAR(?dob) as ?yob) }\n",
    "  OPTIONAL { ?item wdt:P570 ?dod . BIND(YEAR(?dod) as ?yod) }\n",
    "  OPTIONAL { ?item wdt:P1317 ?fl . BIND(YEAR(?fl) as ?fly) }\n",
    "  OPTIONAL { ?item wdt:P2031 ?wpb . BIND(YEAR(?wpb) as ?wyb) }\n",
    "  OPTIONAL { ?item wdt:P2032 ?wpe . BIND(YEAR(?wpe) as ?wye) }\n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create the data frame\n",
    "\n",
    "Run all the SPARQL requests, concatenate the results and drop duplicates"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ento: 10662 records\n",
      "bhl_creator: 24323 records\n",
      "harvard_index: 23870 records\n",
      "zoobank_id: 15210 records\n",
      "ipni_id: 54698 records\n",
      "wikispecies: 46464 records\n",
      "bloodhound_id: 1632 records\n",
      "encyclopedia_australian_science_id: 2798 records\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>item</th>\n",
       "      <th>itemLabel</th>\n",
       "      <th>orcid</th>\n",
       "      <th>viaf</th>\n",
       "      <th>isni</th>\n",
       "      <th>harv</th>\n",
       "      <th>ipni</th>\n",
       "      <th>abbr</th>\n",
       "      <th>bloodhound_id</th>\n",
       "      <th>enc_au_sc_id</th>\n",
       "      <th>yob</th>\n",
       "      <th>yod</th>\n",
       "      <th>wyb</th>\n",
       "      <th>wye</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q67329</td>\n",
       "      <td>Carl Gustav Jablonsky</td>\n",
       "      <td>NaN</td>\n",
       "      <td>24944037</td>\n",
       "      <td>0000 0000 5526 3001</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1756</td>\n",
       "      <td>1787</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q68738</td>\n",
       "      <td>Hermann Müller</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2532803</td>\n",
       "      <td>0000 0001 0837 1728</td>\n",
       "      <td>36129</td>\n",
       "      <td>6735-1</td>\n",
       "      <td>H.Müll.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1829</td>\n",
       "      <td>1883</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66902</td>\n",
       "      <td>Hermann Lebert</td>\n",
       "      <td>NaN</td>\n",
       "      <td>27833384</td>\n",
       "      <td>0000 0001 2100 1924</td>\n",
       "      <td>67704</td>\n",
       "      <td>22162-1</td>\n",
       "      <td>Lebert</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1813</td>\n",
       "      <td>1878</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q69552</td>\n",
       "      <td>Carl Julius Bernhard Börner</td>\n",
       "      <td>NaN</td>\n",
       "      <td>118457204</td>\n",
       "      <td>0000 0001 1085 9124</td>\n",
       "      <td>1763</td>\n",
       "      <td>12350-1</td>\n",
       "      <td>Börner</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1880</td>\n",
       "      <td>1953</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66379</td>\n",
       "      <td>Ludwig Bechstein</td>\n",
       "      <td>NaN</td>\n",
       "      <td>36914329</td>\n",
       "      <td>0000 0001 2278 3438</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1801</td>\n",
       "      <td>1860</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    item                    itemLabel orcid  \\\n",
       "0  http://www.wikidata.org/entity/Q67329        Carl Gustav Jablonsky   NaN   \n",
       "1  http://www.wikidata.org/entity/Q68738               Hermann Müller   NaN   \n",
       "2  http://www.wikidata.org/entity/Q66902               Hermann Lebert   NaN   \n",
       "3  http://www.wikidata.org/entity/Q69552  Carl Julius Bernhard Börner   NaN   \n",
       "4  http://www.wikidata.org/entity/Q66379             Ludwig Bechstein   NaN   \n",
       "\n",
       "        viaf                 isni   harv     ipni     abbr bloodhound_id  \\\n",
       "0   24944037  0000 0000 5526 3001    NaN      NaN      NaN           NaN   \n",
       "1    2532803  0000 0001 0837 1728  36129   6735-1  H.Müll.           NaN   \n",
       "2   27833384  0000 0001 2100 1924  67704  22162-1   Lebert           NaN   \n",
       "3  118457204  0000 0001 1085 9124   1763  12350-1   Börner           NaN   \n",
       "4   36914329  0000 0001 2278 3438    NaN      NaN      NaN           NaN   \n",
       "\n",
       "  enc_au_sc_id   yob   yod  wyb  wye  \n",
       "0          NaN  1756  1787  NaN  NaN  \n",
       "1          NaN  1829  1883  NaN  NaN  \n",
       "2          NaN  1813  1878  NaN  NaN  \n",
       "3          NaN  1880  1953  NaN  NaN  \n",
       "4          NaN  1801  1860  NaN  NaN  "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Run the queries and create a list of data frames\n",
    "frames = []\n",
    "for key, query in queries.items():\n",
    "    dfi = query_wikidata(query)\n",
    "    print(key + ': ' + str(len(dfi.index)) + ' records')\n",
    "    frames.append(dfi)\n",
    "\n",
    "# Concatenate the dataframes from each SPARQL request\n",
    "df = pd.concat(frames)\n",
    "\n",
    "# Drop duplicates\n",
    "df = df.drop_duplicates(subset=['item'])\n",
    "\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Add surname, initials and canonical string (`surname` + ', ' + `initials`) columns "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>item</th>\n",
       "      <th>itemLabel</th>\n",
       "      <th>orcid</th>\n",
       "      <th>viaf</th>\n",
       "      <th>isni</th>\n",
       "      <th>harv</th>\n",
       "      <th>ipni</th>\n",
       "      <th>abbr</th>\n",
       "      <th>bloodhound_id</th>\n",
       "      <th>enc_au_sc_id</th>\n",
       "      <th>yob</th>\n",
       "      <th>yod</th>\n",
       "      <th>wyb</th>\n",
       "      <th>wye</th>\n",
       "      <th>surname</th>\n",
       "      <th>initials</th>\n",
       "      <th>canonical_string</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q67329</td>\n",
       "      <td>Carl Gustav Jablonsky</td>\n",
       "      <td>NaN</td>\n",
       "      <td>24944037</td>\n",
       "      <td>0000 0000 5526 3001</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1756</td>\n",
       "      <td>1787</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Jablonsky</td>\n",
       "      <td>C.G.</td>\n",
       "      <td>Jablonsky, C.G.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q68738</td>\n",
       "      <td>Hermann Müller</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2532803</td>\n",
       "      <td>0000 0001 0837 1728</td>\n",
       "      <td>36129</td>\n",
       "      <td>6735-1</td>\n",
       "      <td>H.Müll.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1829</td>\n",
       "      <td>1883</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Müller</td>\n",
       "      <td>H.</td>\n",
       "      <td>Müller, H.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66902</td>\n",
       "      <td>Hermann Lebert</td>\n",
       "      <td>NaN</td>\n",
       "      <td>27833384</td>\n",
       "      <td>0000 0001 2100 1924</td>\n",
       "      <td>67704</td>\n",
       "      <td>22162-1</td>\n",
       "      <td>Lebert</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1813</td>\n",
       "      <td>1878</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Lebert</td>\n",
       "      <td>H.</td>\n",
       "      <td>Lebert, H.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q69552</td>\n",
       "      <td>Carl Julius Bernhard Börner</td>\n",
       "      <td>NaN</td>\n",
       "      <td>118457204</td>\n",
       "      <td>0000 0001 1085 9124</td>\n",
       "      <td>1763</td>\n",
       "      <td>12350-1</td>\n",
       "      <td>Börner</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1880</td>\n",
       "      <td>1953</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Börner</td>\n",
       "      <td>C.J.B.</td>\n",
       "      <td>Börner, C.J.B.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66379</td>\n",
       "      <td>Ludwig Bechstein</td>\n",
       "      <td>NaN</td>\n",
       "      <td>36914329</td>\n",
       "      <td>0000 0001 2278 3438</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1801</td>\n",
       "      <td>1860</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Bechstein</td>\n",
       "      <td>L.</td>\n",
       "      <td>Bechstein, L.</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    item                    itemLabel orcid  \\\n",
       "0  http://www.wikidata.org/entity/Q67329        Carl Gustav Jablonsky   NaN   \n",
       "1  http://www.wikidata.org/entity/Q68738               Hermann Müller   NaN   \n",
       "2  http://www.wikidata.org/entity/Q66902               Hermann Lebert   NaN   \n",
       "3  http://www.wikidata.org/entity/Q69552  Carl Julius Bernhard Börner   NaN   \n",
       "4  http://www.wikidata.org/entity/Q66379             Ludwig Bechstein   NaN   \n",
       "\n",
       "        viaf                 isni   harv     ipni     abbr bloodhound_id  \\\n",
       "0   24944037  0000 0000 5526 3001    NaN      NaN      NaN           NaN   \n",
       "1    2532803  0000 0001 0837 1728  36129   6735-1  H.Müll.           NaN   \n",
       "2   27833384  0000 0001 2100 1924  67704  22162-1   Lebert           NaN   \n",
       "3  118457204  0000 0001 1085 9124   1763  12350-1   Börner           NaN   \n",
       "4   36914329  0000 0001 2278 3438    NaN      NaN      NaN           NaN   \n",
       "\n",
       "  enc_au_sc_id   yob   yod  wyb  wye    surname initials canonical_string  \n",
       "0          NaN  1756  1787  NaN  NaN  Jablonsky     C.G.  Jablonsky, C.G.  \n",
       "1          NaN  1829  1883  NaN  NaN     Müller       H.       Müller, H.  \n",
       "2          NaN  1813  1878  NaN  NaN     Lebert       H.       Lebert, H.  \n",
       "3          NaN  1880  1953  NaN  NaN     Börner   C.J.B.   Börner, C.J.B.  \n",
       "4          NaN  1801  1860  NaN  NaN  Bechstein       L.    Bechstein, L.  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "surname = []\n",
    "initials = []\n",
    "canonical = []\n",
    "\n",
    "for i, item in df.iterrows():\n",
    "    words = re.split('[ .]', item['itemLabel'])\n",
    "    words = [string for string in words if string != \"\"]\n",
    "    surname.append(words[-1])\n",
    "    initials.append(\".\".join([x[0] for x in words[0:-1]]) + '.')\n",
    "    canonical.append(words[-1] + ', ' + \".\".join([x[0] for x in words[0:-1] if len(x) > 0]) + '.')\n",
    "    \n",
    "df['surname'] = surname\n",
    "df['initials'] = initials\n",
    "df['canonical_string'] = canonical\n",
    "    \n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>item</th>\n",
       "      <th>itemLabel</th>\n",
       "      <th>surname</th>\n",
       "      <th>initials</th>\n",
       "      <th>canonical_string</th>\n",
       "      <th>orcid</th>\n",
       "      <th>viaf</th>\n",
       "      <th>isni</th>\n",
       "      <th>harv</th>\n",
       "      <th>ipni</th>\n",
       "      <th>abbr</th>\n",
       "      <th>bloodhound_id</th>\n",
       "      <th>enc_au_sc_id</th>\n",
       "      <th>yob</th>\n",
       "      <th>yod</th>\n",
       "      <th>wyb</th>\n",
       "      <th>wye</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q67329</td>\n",
       "      <td>Carl Gustav Jablonsky</td>\n",
       "      <td>Jablonsky</td>\n",
       "      <td>C.G.</td>\n",
       "      <td>Jablonsky, C.G.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>24944037</td>\n",
       "      <td>0000 0000 5526 3001</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1756</td>\n",
       "      <td>1787</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q68738</td>\n",
       "      <td>Hermann Müller</td>\n",
       "      <td>Müller</td>\n",
       "      <td>H.</td>\n",
       "      <td>Müller, H.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2532803</td>\n",
       "      <td>0000 0001 0837 1728</td>\n",
       "      <td>36129</td>\n",
       "      <td>6735-1</td>\n",
       "      <td>H.Müll.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1829</td>\n",
       "      <td>1883</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66902</td>\n",
       "      <td>Hermann Lebert</td>\n",
       "      <td>Lebert</td>\n",
       "      <td>H.</td>\n",
       "      <td>Lebert, H.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>27833384</td>\n",
       "      <td>0000 0001 2100 1924</td>\n",
       "      <td>67704</td>\n",
       "      <td>22162-1</td>\n",
       "      <td>Lebert</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1813</td>\n",
       "      <td>1878</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.wikidata.org/entity/Q69552</td>\n",
       "      <td>Carl Julius Bernhard Börner</td>\n",
       "      <td>Börner</td>\n",
       "      <td>C.J.B.</td>\n",
       "      <td>Börner, C.J.B.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>118457204</td>\n",
       "      <td>0000 0001 1085 9124</td>\n",
       "      <td>1763</td>\n",
       "      <td>12350-1</td>\n",
       "      <td>Börner</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1880</td>\n",
       "      <td>1953</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.wikidata.org/entity/Q66379</td>\n",
       "      <td>Ludwig Bechstein</td>\n",
       "      <td>Bechstein</td>\n",
       "      <td>L.</td>\n",
       "      <td>Bechstein, L.</td>\n",
       "      <td>NaN</td>\n",
       "      <td>36914329</td>\n",
       "      <td>0000 0001 2278 3438</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1801</td>\n",
       "      <td>1860</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    item                    itemLabel  \\\n",
       "0  http://www.wikidata.org/entity/Q67329        Carl Gustav Jablonsky   \n",
       "1  http://www.wikidata.org/entity/Q68738               Hermann Müller   \n",
       "2  http://www.wikidata.org/entity/Q66902               Hermann Lebert   \n",
       "3  http://www.wikidata.org/entity/Q69552  Carl Julius Bernhard Börner   \n",
       "4  http://www.wikidata.org/entity/Q66379             Ludwig Bechstein   \n",
       "\n",
       "     surname initials canonical_string orcid       viaf                 isni  \\\n",
       "0  Jablonsky     C.G.  Jablonsky, C.G.   NaN   24944037  0000 0000 5526 3001   \n",
       "1     Müller       H.       Müller, H.   NaN    2532803  0000 0001 0837 1728   \n",
       "2     Lebert       H.       Lebert, H.   NaN   27833384  0000 0001 2100 1924   \n",
       "3     Börner   C.J.B.   Börner, C.J.B.   NaN  118457204  0000 0001 1085 9124   \n",
       "4  Bechstein       L.    Bechstein, L.   NaN   36914329  0000 0001 2278 3438   \n",
       "\n",
       "    harv     ipni     abbr bloodhound_id enc_au_sc_id   yob   yod  wyb  wye  \n",
       "0    NaN      NaN      NaN           NaN          NaN  1756  1787  NaN  NaN  \n",
       "1  36129   6735-1  H.Müll.           NaN          NaN  1829  1883  NaN  NaN  \n",
       "2  67704  22162-1   Lebert           NaN          NaN  1813  1878  NaN  NaN  \n",
       "3   1763  12350-1   Börner           NaN          NaN  1880  1953  NaN  NaN  \n",
       "4    NaN      NaN      NaN           NaN          NaN  1801  1860  NaN  NaN  "
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = df[['item', 'itemLabel', \n",
    "        'surname', 'initials', 'canonical_string', \n",
    "        'orcid', 'viaf', 'isni', 'harv', 'ipni', 'abbr', 'bloodhound_id', 'enc_au_sc_id',\n",
    "        'yob', 'yod', 'wyb', 'wye']]\n",
    "df.reset_index(drop=True, inplace=True)\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv('data/wikidata_persons.csv')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
